# BuiltInFailures.DirectShapeFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..DirectShapeFailures Members
BuiltInFailures..::..DirectShapeFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..DirectShapeFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotCreateDirectShapeOrTypeDocumentCorruption | Cannot create a DirectShape or DirectShapeType. |
| CannotCreateDirectShapeOrTypeError | Cannot create a DirectShape or DirectShapeType. |
| CannotCreateDirectShapeOrTypeWarning | Cannot create a DirectShape or DirectShapeType. |
| CannotCreateDirectShapeRefsWarning | Cannot create reference objects for a DirectShape. |
| CannotCreateDirectShapeTypeRefsWarning | Cannot create reference objects for a DirectShapeType. |

# See Also
BuiltInFailures..::..DirectShapeFailures Class
Autodesk.Revit.DB Namespace